# Задача №1
# Вычислить число c заданной точностью d
# Пример:
# - при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$

from math import pi

d = float(input("Введите точность числа Пи = "))
a = 0
while 0 < d < 1:
    d *= 10
    a += 1
print(f'Число Пи = {round(pi, a)}')