# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# Пример:
# [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

import random

n = int(input('Введите количество элементов списка: '))
lst = [random.randint(0, 9) for i in range(n)]
kort = list(enumerate(lst))
print(f'Список кортежей из {n} элементов = {kort}')
lst = [lst[i] for i in range(n) if i % 2]
print(f'Сумма элементов на нечетной позиции = {sum(lst)}')
