# Создайте программу для игры с конфетами человек против человека.
# Условие задачи: На столе лежит 2021 конфета. Играют два игрока делая ход друг после друга.
# Первый ход определяется жеребьёвкой. За один ход можно забрать не более чем 28 конфет.
# Все конфеты оппонента достаются сделавшему последний ход.
# Сколько конфет нужно взять первому игроку, чтобы забрать все конфеты у своего конкурента?
# a) Добавьте игру против бота

from random import randint


def take_candy(player):
    x = int(input(f'{player}, сколько берете конфет? : '))
    while x < 1 or x > 28:
        print('Так нельзя!')
        x = int(input(f'{player}, введите количество от 1 до 28: '))
    return x


player = input('Введите имя игрока: ')
value = 2021
print(f'На столе лежит {value} конфета')
print('Игроки по очереди берут не более 28 конфет. Побеждает тот, чей ход последний!')
queue = randint(0, 1)
print('Первый ходит - ', end='')
if queue:
    print(player)
else:
    print('Компьютер')

while value > 28:
    if queue:
        k = take_candy(player)
        value -= k
        queue = False
        print(f'Осталось конфет: {value}')
    else:
        k = randint(1, 28)
        value -= k
        queue = True
        print(f'Компьютер взял {k}')
        print(f'Осталось конфет: {value}')

if queue:
    winner = player
else:
    winner = 'Компьютер'
print(f'Выиграл {winner}! Поздравляем все конфеты твои!')
