# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

print('Введите координаты точки А:')
p1 = [int(input('х = ')), int(input('y = '))]
print('Введите координаты точки B:')
p2 = [int(input('х = ')), int(input('y = '))]
length = ((p2[0] - p1[0]) ** 2 + (p2[1] - p1[1]) ** 2) ** 0.5
print(f'Расстояние между точками А ({p1[0]},{p1[1]}) и В ({p2[0]},{p2[1]}) = {round(length, 2)}')
