#Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
#Пример:
#- пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

number = int(input('Введите число: '))
pr_list = []
pr = 1
for i in range(number):
    pr = pr * (i+1)
    pr_list.append(pr)
print(f'Набор произведений от 1 до {number}: {pr_list}')