# Задайте список из N элементов, заполненных числами из промежутка [-N, N].
# Найдите произведение элементов на указанных позициях. Позиции хранятся в отдельном списке
# (пример n=4, lst1=[4,-2,1,3]- список на основе n, а позиции элементов lst2=[3,1].

import random

n = int(input('Введите количество элементов: '))
lstr1 = []
for i in range(n):
    lstr1.append(random.randint(-n, n))
print(f'Список из {n} элементов из интервала [-{n},{n}] = {lstr1}')

k = int(input('Сколько позиций хотите перемножить? : '))
lstr2 = []
for i in range(k):
    lstr2.append(int(input('Введите позицию: ')))

pr = 1
for i in lstr2:
    pr *= lstr1[i - 1]
print(f'Произведение элементов {lstr2} из списка {lstr1} = {pr}')