# Задача №1
# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# Пример:
# [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

import random

n = int(input('Введите количество элементов списка: '))
lst = []
for i in range(n):
    lst.append(random.randint(0, 9))
print(f'Список из {n} элементов = {lst}')

summa = 0
for i in range(1, len(lst), 2):
    summa += lst[i]
print(f'Сумма элементов на нечетной позиции = {summa}')
