# Задача №2
# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

import random

n = int(input('Введите количество элементов списка: '))
lstr1 = []
for i in range(n):
    lstr1.append(random.randint(0, 9))
print(f'Список из {n} элементов = {lstr1}')

lstr2 = []
for i in range((n+1)//2):
    lstr2.append(lstr1[i]*lstr1[n-1-i])
print(f'Произведение пар чисел списка = {lstr2}')