# Задача №4
# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

n = int(input('Введите число: '))
binare = ''
while n > 0:
    binare = str(n % 2) + binare
    n //= 2
print(f'В двоичном = {binare}')
